export const monthPrediction = (month: string) => {
  if (month === "04") {
    return {
      date: "30.06.2026",
      text: "Твой парень — человек действия. Он уверен, что уже подарил тебе пионы, причем дважды. Один раз во сне, второй — когда увидел их в метро и подумал о тебе.",
      promocodeText:
        "Промокод на скидку 15% может заметно ускорить покупку пионов. Не пора ли ему намекнуть?",
    };
  }
  if (month === "05") {
    return {
      date: "12.06.2027",
      text: "Этот человек вообще не спешит — ни с выводами, ни с действиями, ни с пионами. Зато если уж решит, что пора, то все сделает по первому разряду: с ленточкой, открыткой и вазой в тон.",
      promocodeText:
        "Чтобы инвестиция стала более эффективной, он обязательно применит промокод на скидку 15%.",
    };
  }
  if (month === "06") {
    return {
      date: "01.07.2026",
      text: "Он уже трижды собирался подарить тебе пионы. Один раз даже дошел до сайта, но залип на статье «15 признаков, что вы тайный гений». Если снова отвлечется, подарит не пионы, а анемоны просто по ошибке. Но он старался, честно.",
      promocodeText:
        "Хочешь подсказку? Он любит акции! Так что наш промокод на скидку 15% может ему помочь.",
    };
  }
  if (month === "07") {
    return {
      date: "25.06.2026",
      text: "Твой парень держит руку на пульсе. Он уловил все твои намеки, но просто ждет идеального момента. Внутри него уже снят целый романтический мини-сериал: играет музыка, ты зарываешься лицом в ароматные лепестки, кот трется об вазу…",
      promocodeText:
        "Может быть, его ускорит промокод на скидку 15%? Давай попробуем!",
    };
  }
  if (month === "08") {
    return {
      date: "21.10.2029",
      text: "Твой парень видит, как всем вокруг дарят цветы, но следовать тренду не в его вкусе. Ему нужно убедиться, что ты как минимум посвятишь этому поступку рилс, а не просто выложишь историю. Ждать еще неприлично долго.",
      promocodeText:
        "Пусть промокод на скидку 15% станет для него стимулом. А может быть, стоит порадовать себя самостоятельно?",
    };
  }
  if (month === "09") {
    return {
      date: "21.06.2027",
      text: "Терпение, терпение! Он только что закончил исследование сезонности, сортовых особенностей и способов хранения пионов. Переживаем только, что обилие оттенков заставит его углубить экспертизу.",
      promocodeText:
        "В качестве дедлайна для его приготовлений используй промокод на скидку 15% или примени его самостоятельно.",
    };
  }
  if (month === "10") {
    return {
      date: "06.07.2026",
      text: "Пионы или розы? Белые или розовые? Сегодня или завтра? 15 или 17 штук? И это он еще не думал о тексте записки. В общем, пионы точно будут, но нужно попросить в лоб и дать ссылку.",
      promocodeText:
        "К ссылке хорошо приложить промокод на скидку 15% — он примет намек без колебаний!",
    };
  }
  if (month === "11") {
    return {
      date: "12.08.2026",
      text: "Мы видим, что пионы уже у него в корзине! Но он не нажимает на кнопку заказа, потому что это слишком просто. Он держит интригу. Может заказать их анонимно, а потом спросить, от кого букет.",
      promocodeText:
        "Даже такие изобретательные ребята любят скидки. Промокод на 15% будет очень кстати!",
    };
  }
  if (month === "12") {
    return {
      date: "05.09.2026",
      text: "Мы точно знаем: он был на нашем сайте и листал букеты из пионов, а потом вдруг вспомнил, что хотел попробовать парусный спорт. Затем ему попались горящие билеты в Калининград, и дальше все как в тумане.",
      promocodeText:
        "Промокод на скидку 15% мгновенно напомнит витающему в облаках, как сильно вы любите пионы.",
    };
  }
  if (month === "01") {
    return {
      date: "15.12.2026",
      text: "Ах, в декабре цветочный сезон закончится. Подарки будут, но нужно проверить, не выгоднее ли дарить ромашки в пересчете на квадратный сантиметр лепестка.",
      promocodeText:
        "Чтобы он успел порадовать тебя в сезон пионов, отправь ему промокод на скидку 15%. Рациональный ум быстро поймет намек!",
    };
  }
  if (month === "02") {
    return {
      date: "20.07.2026",
      text: "Он видит, что всем вокруг дарят пионы, и ему это не нравится. Подарок как у всех не его тема. Жди от него муравьиную ферму или мох в колбе. А если уж пионы, то он преподнесет их как минимум в велосипедном шлеме.",
      promocodeText:
        "Креативные подарки требуют разумных решений, например промокода на скидку 15%. Намекнем ему?",
    };
  }
  if (month === "03") {
    return {
      date: "27.06.2026",
      text: "Он очень хочет подарить тебе пионы, но стесняется. Вдруг это слишком прямолинейно и напористо? Нужно подумать, почувствовать, поволноваться, что ты не любишь розовый цвет. Не дави, но и не забывай намекать: пара тематических рилсов — и он решится.",
      promocodeText:
        "Еще один стимул — промокод на скидку 15%. Вдруг с ним он решится даже быстрее?",
    };
  }
};
